






bootmem
=========
 |
 |
 |    +--------------+
 +--->| Linux 2.6.12 |
 |    +--------------+
 |         |
 |         +--- bootmem: 1. 提供了一个完整的 bootmem 内存分配器，用于管理
 |                          Linux 内核启动阶段的内存分配、释放和预留。
 |                       2. Linus 将所有的 bootmem 代码添加到 git 里。
 |
 |    +----------------+
 +--->| Linux 2.6.12.1 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.2 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.3 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.4 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.5 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.6 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.13 |
 |    +--------------+
 |         |
 |         +--- bootmem: 1. 提供了在未启用 CONFIG_HAVE_ARCH_ALLOC_REMAP 宏的
 |                          情况下 "alloc_remap()" 函数的实现。
 |                       2. 针对 i386 架构，新增了 saved_max_pfn 变量，用于
 |                          维护当前系统最大可用物理帧。
 |                       3. 使用 ALIGN() 替换了 bootmem 分配器的对齐方式.
 |                       4. bootmem 支持早期的 PFN.
 | 
 |    +----------------+
 +--->| Linux 2.6.13.1 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.14 |
 |    +--------------+
 |         |
 |         +--- bootmem: 1. 提供带 limit 限制的接口函数实现.
 |
 |    +--------------+
 o--->| Linux 2.6.15 |
      +--------------+
           |
           +--- bootmem: 1. bootmem 将可用物理页释放给 buddy 内存分配器时，
                            将可用页的引用计数设置为 0.
                         2. 当 bootmem 在当前节点中找不到可用物理内存，那么
                            可以去其他节点中查找.































