






PCP
=========
 |
 |
 |    +--------------+
 +--->| Linux 2.6.12 |
 |    +--------------+
 |         |
 |         +--- PCP: [*] 提供了一个完整的 PCP 内存分配器，用于管理
 |                       Linux 内核的单个物理页的分配和释放。
 |                   [*] Linus 将所有的 PCP 代码添加到 git 里。
 |
 |    +----------------+
 +--->| Linux 2.6.12.1 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.2 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.3 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.4 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.5 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.6 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.13 |
 |    +--------------+
 |         |
 |         +--- PCP: [*] struct zone 支持 NUMA/UMA pageset 成员.
 |                   [*] start_kernel() 中新增 setup_per_cpu_pageset() 调用.
 |                   [*] NUMA 体系中添加 pageset_table[] 数组.
 |                   [*] 新增 PCP Hot/Cold 链表 batchsize 计算方法.
 |                   [*] 增加 /proc/zoneinfo 对 PCP count 数量的打印.
 |                   [*] PCP 初始化代码转移到 setup_pageset() 函数.
 | 
 |    +----------------+
 +--->| Linux 2.6.13.1 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.14 |
 |    +--------------+
 |         |
 |         +--- PCP: [*] 提供对 cpuset_zone_allowed() 的支持.
 |
 |    +--------------+
 o--->| Linux 2.6.15 |
      +--------------+
           |
           +--- PCP: [*] 修改了 PCP batchsize 的算法.
                     [*] PCP 分配器初始时，将 Hot 页链表的 low 参数设置为 0，
                         将 Cold 页链表的 batch 设置为 "max(1UL, batch/2)".































