






SLAB
=========
 |
 |
 |    +--------------+
 +--->| Linux 2.6.12 |
 |    +--------------+
 |         |
 |         +--- SLAB: [*] 提供了一个完整的 SLAB 内存分配器，用于分配小粒度内存
 |                    [*] 增加 kmem_cache_alloc_node() 和 kmalloc_node() 函数，
 |                        使其在 NUMA 架构中从指定 NODE 中分配内存.
 |                    [*] 增加 kmem_find_general_cachep() 函数以便获得通用高速
 |                        缓存.
 |
 |    +----------------+
 +--->| Linux 2.6.12.1 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.2 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.3 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.4 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.5 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.6 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.13 |
 |    +--------------+
 |         |
 |         +--- SLAB: [*] 增加 kmem_cache_name() 函数获得高速缓存名字.
 |                    [*] 增加 kstrdup() 函数用于为字符串分配空间并拷贝内容到
 |                        新分配的内存上.
 |                    [*] 修复 kmem_cache_alloc_node() 从当前阶段分配缓存对象.
 | 
 |    +----------------+
 +--->| Linux 2.6.13.1 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.14 |
 |    +--------------+
 |         |
 |         +--- SLAB: [*] 将 kmem_bufctl_t 的定义迁移到 mm/slab.c.
 |                    [*] 从高速缓存中分配缓存时，使用 prefetchw() 预加载缓存
 |                        对象.
 |                    [*] 将 kcalloc() 函数替换成 kzalloc() 函数.
 |                    [*] 支持本地高速缓存的缓存栈.
 |                    [*] 支持共享高速缓存.
 |                    [*] 支持 NUMA 架构多节点 slab 链表.
 |
 |    +--------------+
 o--->| Linux 2.6.15 |
 |    +--------------+
 |         |
 |         +--- SLAB: [*] 将 struct kmem_cache_s 修改为 struct kmem_cache.
 |                    [*] 提供 page、slab 与高速缓存之间的绑定函数.
 |                    [*] 提供 SLAB 从 Buddy 分配器获得内存的统一接口.
 |
 |    +--------------+
 o--->| Linux 2.6.16 |
      +--------------+
           |
           +--- SLAB: [*] 提供了 calculate_slab_order() 函数用于计算 slab 占用
                          的物理页数量.
                      [*] 修改了 SLAB 相关代码风格.
                      [*] 将 kzalloc() 函数和 kstrdup() 函数移动到 mm/util.c.
                      [*] 增加对 SLOB 分配器的支持.
                      [*] 将 SLAB 中的 up/down 换成了互斥锁.
                      [*] 采用 buffer_size 成员表示高速缓存对象的长度.
                      [*] 支持 cache_estimate() 函数对外部 slab 管理数据的支持.o                      [*] 增加 slab_destroy_objs() 函数.
                      [*] 提供 slab_get_obj() 函数和 slab_put_obj() 函数.
                      [*] 提供 virt_to_cache() 函数和 virt_to_slab() 函数.
                      [*] 提供 cpu_get_cache() 函数获得本地高速缓存.
                      [*] 采用 struct kmem_cache 维护高速缓存.






























