






VMALLOC
=========
 |
 |
 |    +--------------+
 +--->| Linux 2.6.12 |
 |    +--------------+
 |         |
 |         +--- VMALLOC: [*] 提供了一个完整的 VMALLOC 内存分配器，用于管理
 |                           Linux 内核的单个物理页的分配和释放。
 |                       [*] Linus 将所有的 VMALLOC 代码添加到 git 里。
 |
 |    +----------------+
 +--->| Linux 2.6.12.1 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.2 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.3 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.4 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.5 |
 |    +----------------+
 |
 |    +----------------+
 +--->| Linux 2.6.12.6 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.13 |
 |    +--------------+
 |         |
 |         +--- VMALLOC: [*] 新增页表权限 PAGE_KERNEL_EXEC，使分配的虚拟内存
 |                           拥有执行和读写权限.
 |                       [*] 新增 __remove_vm_area() 函数，更新 remove_vm_area
 |                           函数的内部实现.
 | 
 |    +----------------+
 +--->| Linux 2.6.13.1 |
 |    +----------------+
 |
 |    +--------------+
 +--->| Linux 2.6.14 |
 |    +--------------+
 |         |
 |         +--- VMALLOC: [*] 将 IOREMAP_MAX_ORDER 宏定义移到 vmalloc.h
 |                       [*] 修改 VMALLOC 分配器分配标志为 gfp_t.
 |
 |    +--------------+
 o--->| Linux 2.6.15 |
      +--------------+
           |
           +--- VMALLOC: [*] 新增 vmalloc_node() 函数.
                         [*] 新增 __vmalloc_node() 函数.
                         [*] VMALLOC 建立 PTE 页表时，移除了 init_mm 的
                             page_table_lock 锁.































